diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.АдресГрафика);
	
	ГрафикОтпусков.Обновление = Ложь;
	ГрафикОтпусков.Очистить();
	ГрафикОтпусков.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	ГрафикОтпусков.ОтображениеТекстаИнтервала = ОтображениеТекстаИнтервалаДиаграммыГанта.Отображать;
	
	ШкалаВремени = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени;
	ШкалаВремени.Элементы[0].Единица  = ТипЕдиницыШкалыВремени.Месяц;
	
	Для Каждого Стр Из ОтпускаСотрудников Цикл
		МассивСклонения = ПолучитьСклоненияСтрокиПоЧислу("День"
													    , Стр.КоличествоДней
													    , ""
													    , "ЧС=Количественное"
													    , "ПД=Винительный");
													    
	    Точка = ГрафикОтпусков.УстановитьТочку(Стр.Сотрудник);    	    
	    Серия = ГрафикОтпусков.УстановитьСерию("График");
	    
	    Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
	    Значение.Текст = МассивСклонения[0];
	                   
	    Интервал = Значение.Добавить();
	    Интервал.Начало = Стр.ДатаНачала;
	    Интервал.Конец = Стр.ДатаОкончания;
	КонецЦикла;
	
	ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
